import { Buff, BuffDefinition } from './types';

export const getBuffImageUrl = (name: string, buff: BuffDefinition): string => {
  if (!!buff.specialImageUrl) return buff.specialImageUrl;
  if (buff.unuseImage)
    return `/images/buffs/default-${buff.type === '负面' ? 'debuff' : 'buff'}.png`;
  return `/images/buffs/${encodeURIComponent(name)}.png`;
};

const buffDefinitions: Record<string, BuffDefinition> = {
  移动: {
    type: '特殊',
    global: false,
    target: '角色',
    description:
      '改变角色在水平方向上的运动速度。角色的"移动速度"属性表示该角色在水平面上移动时的基础速度。角色在水平和竖直方向上的合速度不会超过[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)。',
    detailedDescription:
      '使角色在水平方向上持续{受力}，并因此改变运动速度。角色的"移动速度"属性表示该角色在水平面上移动时的基础速度。角色在水平和竖直方向上的合速度不会超过[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)。',
    stack: '具体效果受角色基础移动速度，以及{加速}/{减速}的影响。',
    detailedStack:
      '具体效果受角色基础移动速度，以及{加速}/{减速}的影响。所有加速/{减速}效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%。',
    unuseImage: true,
  },
  加速: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#移速提高', '#提高.*移速', '#移速增加', '#增加.*移速'],
    description:
      '使移速提高一定百分比。角色在水平和竖直方向上的合速度不会超过[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)。',
    stack: '所有加速/{减速}效果均为**乘算叠加**。',
    detailedStack:
      '所有加速/{减速}效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%。',
    source: [
      { name: '牛奶', type: 'item' },
      { name: '逃窜', type: 'knowledgeCard' },
      { name: '鼓舞', type: 'skill' },
    ],
    unuseImage: true,
  },
  减速: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['%移速降低', '#降低.*移速', '#移速减少', '#减少.*移速'],
    description: '使移速降低指定百分比。',
    stack: '所有{加速}/减速效果均为**乘算叠加**。',
    detailedStack:
      '所有{加速}/减速效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%。',
    source: [
      { name: '果子', type: 'item' },
      { name: '威压', type: 'knowledgeCard' },
      { name: '捣蛋鬼', type: 'skill' },
    ],
    unuseImage: true,
  },
  跳跃: {
    type: '特殊',
    global: false,
    target: '角色',
    description:
      '改变角色在竖直方向上的运动速度。角色按住跳跃键的时间长短会决定其跳跃高度（有上限）。角色的"跳跃高度"属性表示该角色[大跳](保持长按跳跃键以达到当前所能达到的最大跳跃高度)时达到的高度。角色在水平和竖直方向上的合速度不会超过[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)，因此跳跃高度不超过[跳跃高度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒，又因为游戏内重力加速度为3000/秒²，因此在默认重力情况下平跳的跳跃高度上限约为660。当角色持有失重/超重效果时，该数值会发生变化)。',
    detailedDescription:
      '使角色在竖直方向上{受力}，并因此改变运动速度。角色按住跳跃键的时间长短会决定其跳跃高度（有上限）。角色的"跳跃高度"属性表示该角色[大跳](保持长按跳跃键以达到当前所能达到的最大跳跃高度)时达到的高度。角色在水平和竖直方向上的合速度不会超过[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)，因此跳跃高度不超过[跳跃高度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒，又因为游戏内重力加速度为3000/秒²，因此在默认重力情况下平跳的跳跃高度上限约为660。当角色持有失重/超重效果时，该数值会发生变化)。',
    stack: '具体效果受角色基础跳跃高度，以及{提高跳跃高度}/{降低跳跃高度}的影响。',
    detailedStack:
      '具体效果受角色基础跳跃高度，以及{提高跳跃高度}/{降低跳跃高度}的影响。所有提高/{降低跳跃高度}效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%，提高跳跃高度效果需转化为提高跳跃速度的数值才能进行计算。',
    unuseImage: true,
  },
  提高跳跃高度: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#提高.*跳跃.?度', '#增加.*跳跃.?度', '#跳跃.?度提高', '#跳跃.?度增加'],
    description:
      '使跳跃高度提高指定百分比，但不超过[跳跃高度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒，又因为游戏内重力加速度为3000/秒²，因此在默认重力情况下平跳的跳跃高度上限约为660。当角色持有失重/超重效果时，该数值会发生变化)。\n另注：提高跳跃高度本质上是提高跳跃初速度，因此"提高跳跃高度"和"提高跳跃速度"的本质相同，但数值不同，可通过物理公式进行计算替换（即二者数值相同时，"提高跳跃高度"的效果要弱于"提高跳跃速度"，因为后者计算时需要平方）。',
    stack: '所有提高/{降低跳跃高度}效果均为**乘算叠加**。',
    detailedStack:
      '所有提高/{降低跳跃高度}效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%，提高跳跃高度效果需转化为提高跳跃速度的数值才能进行计算。',
    source: [
      { name: '飞跃', type: 'knowledgeCard' },
      { name: '鼓舞', type: 'skill' },
    ],
    unuseImage: true,
  },
  降低跳跃高度: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#降低.*跳跃.?度', '#减少.*跳跃.?度', '#跳跃.?度降低', '#跳跃.?度减少'],
    description:
      '使跳跃高度降低指定百分比。\n另注：降低跳跃高度本质上是降低跳跃初速度，因此"降低跳跃高度"和"降低跳跃速度"的本质相同，但数值不同，可通过物理公式进行计算替换（即二者数值相同时，"降低跳跃高度"的效果要弱于"降低跳跃速度"，因为后者计算时需要平方）。',
    stack: '所有降低/{提高跳跃高度}效果均为**乘算叠加**。',
    detailedStack:
      '所有降低/{提高跳跃高度}效果均为**乘算叠加**。计算公式：基础速度×(1+加速)×……×(1-减速1)×……，其中加/减速单位为%，提高跳跃高度效果需转化为提高跳跃速度的数值才能进行计算。',
    source: [{ name: '捣蛋鬼', type: 'skill' }],
    unuseImage: true,
  },
  交互: {
    type: '特殊',
    global: false,
    target: '角色',
    description:
      '使角色与其他物体(道具、衍生物、场景物等)产生互动，由此触发对应效果。每个交互都有基础的交互时长，在此之上受其它增减速影响。鼠角色的"推速"属性反映了其单独进行推奶酪交互时的基础速度（百分比每秒）。',
    stack: '具体效果受{提高交互速度}/{降低交互速度}的影响。',
    detailedStack:
      '具体效果受{提高交互速度}/{降低交互速度}的影响。通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。计算公式：基础速度×(1+百分比加速)×(1-百分比减速)+固定值加速-固定值减速，其中百分比加/减速单位为%。',
    source: [
      { name: '老鼠夹', type: 'item' },
      { name: '抓住', type: 'skill' },
    ],
    unuseImage: true,
  },
  提高交互速度: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: [
      '#[(推)(挣脱)(挣扎)(救援)(交互)(钻管道)(绑火箭)].*速[(增加)(提高)]',
      '#[(增加)(提高)].*[(推)(挣脱)(挣扎)(救援)(交互)(钻管道)(绑火箭)].*速',
    ],
    description:
      '使所有或指定类型的交互速度按**固定值**或**百分比**提高，例如推奶酪、火箭救援、绑火箭速度等。其中"推速"特指推奶酪速度。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。计算公式：基础速度×(1+百分比加速)×(1-百分比减速)+固定值加速-固定值减速，其中百分比加/减速单位为%。',
    source: [
      { name: '心灵手巧', type: 'knowledgeCard' },
      { name: '奶酪好手', type: 'skill' },
    ],
    unuseImage: true,
  },
  降低交互速度: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: [
      '#[(推)(挣脱)(挣扎)(救援)(交互)(钻管道)(绑火箭)].*速[(降低)(减少)]',
      '#[(降低)(减少)].*[(推)(挣脱)(挣扎)(救援)(交互)(钻管道)(绑火箭)].*速',
    ],
    description:
      '使所有或指定类型的交互速度按**固定值**或**百分比**降低，例如推奶酪、火箭救援、绑火箭速度等。其中"推速"特指推奶酪速度。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。计算公式：基础速度×(1+百分比加速)×(1-百分比减速)+固定值加速-固定值减速，其中百分比加/减速单位为%。',
    source: [
      { name: '救救我', type: 'knowledgeCard' },
      { name: '煎蛋', type: 'entity' },
    ],
    unuseImage: true,
  },
  回复: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#回复', '瞬间回复', '%回血'],
    duration: 'disposable',
    description: '使角色立刻增加一定Hp，但不会直接解除{虚弱}。',
    source: [
      { name: '牛奶', type: 'item' },
      { name: '鼓舞', type: 'skill' },
    ],
    unuseImage: true,
  },
  伤害: {
    type: '负面',
    global: false,
    target: '角色',
    duration: 'disposable',
    description:
      '使角色立刻减少一定Hp，若Hp因此降低至0以下则进入{虚弱}。部分伤害能触发{感电}效果，称之为电击伤害。',
    stack:
      '伤害可受{增伤}、{减伤}、{易伤}、{削伤}、{伤害转移}的影响，同时有三种计算方式分型，不同分型可受的影响范围不同。',
    detailedStack:
      '伤害可受{增伤}、{减伤}、{易伤}、{削伤}、{伤害转移}的影响，同时有三种计算方式分型，不同分型可受的影响范围不同。\n**受双方增减伤影响**：可受{增伤}、{减伤}、{易伤}、{削伤}、{伤害转移}的影响；在本网站中，这类伤害会在其具体数值之上呈现注释，提示可受攻击增伤影响。例：造成{50}伤害。\n**受目标增减伤影响**：不受{增伤}、{削伤}的影响，受{减伤}、{易伤}、{伤害转移}的影响；在本网站中，这类伤害通常不会作特别注释，或会注释"不受攻击增伤影响"。\n**不受增减伤影响**：不受{增伤}、{减伤}、{易伤}、{削伤}的影响，受{伤害转移}的影响；在本网站中，这类伤害会作特别注释。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [{ name: '感电', type: 'skill' }],
    unuseImage: true,
  },
  增伤: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: [
      '%兴奋',
      '%攻击力',
      '%攻击增伤',
      '#[(攻击力)(增伤)].*[(提高)(提升)(增加)]',
      '#[(提高)(提升)(增加)].*[(攻击力)(增伤)]',
      '#伤害[(提高)(增加)]',
    ],
    description: '按**固定值**提高自身的攻击增伤，或按**百分比**提高自身的**基础**攻击增伤。',
    detailedDescription:
      '按**固定值**提高自身的攻击增伤，或按**百分比**提高自身的**基础**攻击增伤。\n注意："增伤"类效果作用目标为攻击者，因此只会影响**受双方增减伤影响**的伤害，例如爪刀。在本网站中，这类伤害会在其具体数值之上呈现注释，提示可受攻击增伤影响。例：造成{50}伤害。"增伤"类效果无法影响**受目标增减伤影响**和**不受增减伤影响**的伤害，例如{小鞭炮}或{垃圾桶}。在本网站中，前者通常不会作特别注释，或会注释"不受攻击增伤影响"；后者会作特别注释。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '小鞭炮', type: 'item' },
      { name: '垃圾桶', type: 'entity' },
      { name: '兴奋药水', type: 'item' },
      { name: '攻击战旗', type: 'entity' },
      { name: '越战越勇', type: 'skill' },
    ],
    unuseImage: true,
  },
  减伤: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['%防御', '#减伤', '%受到.?伤害降低', '%受击减伤'],
    description: '按**固定值**或**百分比**降低自身受到的{伤害}。',
    detailedDescription:
      '按**固定值**或**百分比**降低自身受到的{伤害}。\n注意："减伤"类效果作用目标为受击者，因此会影响**受双方增减伤影响**和**受目标增减伤影响**的伤害，例如爪刀或{小鞭炮}。在本网站中，前者会在其具体数值之上呈现注释，提示可受攻击增伤影响，例如"造成{50}伤害"；后者通常不会作特别注释，或会注释"不受攻击增伤影响"。"减伤"类效果无法影响**不受增减伤影响**的伤害，例如{垃圾桶}。在本网站中，这类伤害会作特别注释。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '小鞭炮', type: 'item' },
      { name: '垃圾桶', type: 'entity' },
      { name: '天使翅膀', type: 'skill' },
      { name: '攻无不克', type: 'skill' },
    ],
    unuseImage: true,
  },
  易伤: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#易伤', '%受到.*伤害提高', '%受击增伤'],
    description: '按**固定值**提高自身受到的伤害。',
    detailedDescription:
      '按**固定值**提高自身受到的伤害。\n注意："减伤"类效果作用目标为受击者，因此会影响**受双方增减伤影响**和**受目标增减伤影响**的伤害，例如爪刀或{小鞭炮}。在本网站中，前者会在其具体数值之上呈现注释，提示可受攻击增伤影响，例如"造成{50}伤害"；后者通常不会作特别注释，或会注释"不受攻击增伤影响"。"减伤"类效果无法影响**不受增减伤影响**的伤害，例如{垃圾桶}。在本网站中，这类伤害会作特别注释。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。不过由于易伤目前暂时只有一种来源，因此不考虑叠加特性。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。不过由于易伤目前暂时只有一种来源，因此不考虑叠加特性。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '小鞭炮', type: 'item' },
      { name: '垃圾桶', type: 'entity' },
      { name: '托普斯分身', type: 'entity' },
    ],
    unuseImage: true,
  },
  削伤: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#削伤', '%造成.*伤害降低', '%攻击减伤'],
    description: '按**固定值**或**百分比**降低自身造成的伤害（不低于0）。',
    detailedDescription:
      '按**固定值**或**百分比**降低自身造成的伤害（不低于0）。\n注意："削伤"类效果作用目标为攻击者，因此只会影响**受双方增减伤影响**的伤害，例如爪刀。在本网站中，这类伤害会在其具体数值之上呈现注释，提示可受攻击增伤影响。例：造成{50}伤害。"增伤"类效果无法影响**受目标增减伤影响**和**不受增减伤影响**的伤害，例如{小鞭炮}或{垃圾桶}。在本网站中，前者通常不会作特别注释，或会注释"不受攻击增伤影响"；后者会作特别注释。',
    stack:
      '通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。',
    detailedStack:
      '通常来说，数值的固定值与百分比形式互相独立，[[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入伤害计算公式中。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '小鞭炮', type: 'item' },
      { name: '垃圾桶', type: 'entity' },
      { name: '垃圾盖', type: 'skill' },
      { name: '守株待鼠', type: 'knowledgeCard' },
      { name: '必备专业素养', type: 'skill' },
    ],
    unuseImage: true,
  },
  伤害转移: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#伤害.*转移', '#转移.*伤害'],
    description: '将友方所受伤害的一定**百分比**转移至自身，以此减少友方所受伤害。',
    detailedDescription:
      '将友方所受伤害的一定**百分比**转移至自身，以此减少友方所受伤害。伤害转移效果具有修正机制：在正式结算伤害转移前，待结算伤害值不会超过友方的Hp上限。例：天使泰菲使用{1级友情庇护}为恶魔泰菲施加50%的伤害转移，此时恶魔泰菲受到{蓄力重击}造成的1000伤害，但由于自身Hp上限为74，因此最终结果为天使泰菲和恶魔泰菲各受37伤害。',
    stack:
      '伤害转移和{状态转移}分别结算。若一个状态既有伤害又有控制，则可能因分别结算而出现结算2次伤害转移和1次状态转移的情况。',
    detailedStack:
      '伤害转移和{状态转移}分别结算。若一个状态既有伤害又有控制，则可能因分别结算而出现结算2次伤害转移和1次状态转移的情况。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '友情庇护', type: 'skill' },
      { name: '蓄力重击', type: 'specialSkill' },
      { name: '双重猫格', type: 'skill' },
      { name: '有难同当', type: 'knowledgeCard' },
    ],
    unuseImage: true,
  },
  状态转移: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#[(状态)(效果)].*转移', '#转移.*[(状态)(效果)]'],
    description: '友方受到指定状态时，使友方解除指定状态，但随后自身受到指定状态。',
    stack:
      '{伤害转移}和状态转移分别结算。若一个状态既有伤害又有控制，则可能因分别结算而出现结算2次伤害转移和1次状态转移的情况。',
    detailedStack:
      '{伤害转移}和状态转移分别结算。若一个状态既有伤害又有控制，则可能因分别结算而出现结算2次伤害转移和1次状态转移的情况。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    source: [
      { name: '友情庇护', type: 'skill' },
      { name: '双重猫格', type: 'skill' },
    ],
    unuseImage: true,
  },
  拾取: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#拾取'],
    duration: 'disposable',
    description:
      '使角色拾取对应物品（包括道具/药水）并储存在对应键位上，但若对应位置已有其它物品则会掉落。',
    source: [
      { name: '鞭炮', type: 'item' },
      { name: '飞翔金币', type: 'skill' },
      { name: '奇思妙想', type: 'skill' },
    ],
    unuseImage: true,
  },
  掉落: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['%击落', '%掉落'],
    duration: 'disposable',
    description: '使角色手中的指定物品（例如道具/老鼠）掉落。',
    source: [
      { name: '猛攻', type: 'knowledgeCard' },
      { name: '红色卡牌', type: 'entity' },
    ],
    unuseImage: true,
  },
  改变朝向: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#改变.*朝向', '#朝向.*改变'],
    description: '使角色的面朝方向发生改变，会影响部分技能的释放方向和效果。',
    source: [
      { name: '香水瓶', type: 'item' },
      { name: '香风折扇', type: 'skill' },
    ],
    unuseImage: true,
  },
  临时切换键位: {
    type: '特殊',
    global: false,
    target: '角色',
    description: '使角色的操作键位（移动键位，技能键位等）临时发生改变。',
    source: [{ name: '幻风礼服', type: 'skill' }],
    unuseImage: true,
  },
  受力: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#受.*力'],
    description:
      '使目标改变速度，但最终速度不超过速度上限（即2000/秒）。一次性受力会瞬间改变目标速度，持续受力则会使目标速度保持在某一数值。',
    source: [{ name: '鞭炮', type: 'item' }],
    unuseImage: true,
  },
  碰撞: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#碰撞', '#挤压', '#命中'],
    description:
      '投掷类道具/衍生物与其目标碰撞时产生命中效果；其它情况则使参与碰撞的双方{受力}，改变速度。',
    unuseImage: true,
  },
  改变体型: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#体型'],
    description: '使自身体型改变，碰撞体积与部分特效大小随之改变。',
    source: [{ name: '小情绪', type: 'skill' }],
    unuseImage: true,
  },
  保持惯性: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#保持惯性'],
    description: '使目标的速度保持不变，直到保持惯性效果结束，或是再次受力。',
    source: [
      { name: '牛仔吉他', type: 'skill' },
      { name: '鞭炮', type: 'item' },
    ],
    unuseImage: true,
  },
  '改变惯性/质量': {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(改变)(增)(减)(提高)(降低)].*[(惯性)(质量)]'],
    description:
      '使目标的惯性改变，或者也可以说是使目标的"质量"改变。改变后，角色的移动特性、道具的投掷及受力时的初速度会发生变化。',
    detailedDescription:
      '使目标的惯性改变，或者也可以说是使目标的"质量"改变。改变后，角色的移动特性、道具的投掷及受力时的初速度会发生变化。\n正常情况下，角色在接触地面时可以认为是没有惯性，而在空中时的惯性较大；道具的惯性（质量）是固定的，越"轻"的道具被投掷时的初速度越快，但不会超过[速度上限](所有角色/道具的速度均无法超过2000/秒，传送效果除外)。',
    source: [{ name: '头盔', type: 'entity' }],
    unuseImage: true,
  },
  失重: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(增加)(提高)].*重力', '#重力.*[(增加)(提高)]', '#失重'],
    description:
      '降低自身受到的重力加速度，延长滞空时间。注："完全失重"指的是暂时无视重力对自身的影响，也可以认为是将重力加速度变为0。',
    detailedDescription:
      '降低自身受到的重力加速度，延长滞空时间。注："完全失重"指的是暂时无视重力对自身的影响，也可以认为是将重力加速度变为0。\n游戏内默认重力环境下的重力加速度为3000/秒²，角色速度上限为2000/秒。失重不会改变速度上限的大小。',
    stack: '待进一步测试。',
    source: [
      { name: '魔术漂浮', type: 'specialSkill' },
      { name: '蓝色卡牌', type: 'entity' },
      { name: '世界波', type: 'skill' },
    ],
    unuseImage: true,
  },
  超重: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(降低)(减少)].*重力', '#重力.*[(降低)(减少)]', '#超重'],
    description: '提高自身受到的重力加速度，缩短滞空时间。',
    detailedDescription:
      '提高自身受到的重力加速度，缩短滞空时间。\n游戏内默认重力环境下的重力加速度为3000/秒²，角色速度上限为2000/秒。失重不会改变速度上限的大小。',
    stack: '待进一步测试。',
    source: [{ name: '头盔', type: 'entity' }],
    unuseImage: true,
  },
  传送: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#传送'],
    description:
      '使目标瞬间到达指定位置，且立刻切换到对应位置的视野。传送不受[速度上限](游戏内所有物体在水平和竖直方向上的合速度均不能超过某一指定数值，目前测量该数值为2000/秒)影响。',
    source: [{ name: '闪亮营救', type: 'skill' }],
    unuseImage: true,
  },
  远视: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#视野范围提高', '#提高.*视野范围'],
    description: '使角色视野范围提高。',
    stack:
      '视野更改效果均为乘算叠加，但现版本绝大多数由技能/道具获得的远视效果会按优先级互相覆盖顶替，导致无法叠加。目前仅有天宫的香炉、特工行动的远视以及玩吧自定义地图设置中的远视能在部分情况下与其他远视叠加。',
    source: [
      { name: '远视药水', type: 'item' },
      { name: '警戒', type: 'skill' },
    ],
    unuseImage: true,
  },
  视野范围降低: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['%近视', '#视野范围降低', '#降低.*视野范围'],
    description: '使角色视野范围降低。',
    stack: '同类效果持续时间互不影响，视野更改效果均为乘算叠加。',
    source: [{ name: '意式披萨', type: 'skill' }],
    unuseImage: true,
  },
  遮蔽视野: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#遮[(避)(挡)].*视野'],
    description: '使玩家视野中的指定区域被黑色或其他模型所覆盖，无法查看。',
    unuseImage: true,
  },
  隐藏小地图键: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#隐藏小地图'],
    description: '使角色的小地图键被隐藏，无法查看。',
    source: [
      { name: '胡椒瓶', type: 'item' },
      { name: '烟雾弹', type: 'skill' },
    ],
    unuseImage: true,
  },
  隐匿: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['隐藏小地图位置', '不显示小地图位置', '#[(小地图)(位置)(视野)(不显示)(隐匿)]{3,}'],
    description: '使自身小地图位置对敌方不可见，但无法免疫一部分{暴露位置}效果。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    unuseImage: true,
  },
  暴露位置: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['%暴露.*视野', '#暴露.*位置', '#[(小地图)(位置)(视野)(显示)(暴露)]{3,}'],
    description: '使敌方能在小地图上看到自身位置。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    source: [
      { name: '奶酪', type: 'item' },
      { name: '远视饮料', type: 'item' },
      { name: '屈打成招', type: 'knowledgeCard' },
      { name: '寻踪', type: 'knowledgeCard' },
    ],
    unuseImage: true,
  },
  改变模型透明度: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#模型.*透明', '#透明.*模型'],
    description:
      '使自身角色模型（包括昵称及Hp条等）的透明度产生变化，变得半透明或全透明。注意：部分特效仍然会保持原透明度，例如角色从高处落地时产生的"脚气"烟雾特效，{魅力香水}在自身周围的环绕特效等。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    source: [
      { name: '隐身', type: 'skill' },
      { name: '隐藏模型', type: 'skill' },
      { name: '魅力香水', type: 'entity' },
      { name: '喜剧之王', type: 'skill' },
    ],
    unuseImage: true,
  },
  无法移动: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(禁用)(无法)].*移动', '#移动.*[(禁用)(无法)]'],
    description: '使角色无法进行移动操作，包括移动和跳跃。{飞行}期间的上下移动不受影响。',
    stack: '同类效果持续时间互相独立，但只会同时生效一个。',
    unuseImage: true,
  },
  禁用技能: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(禁用)(无法使用)].*技能', '#技能.*[(禁用)(无法使用)]', '无法使用技能', '%沉默'],
    description:
      '使角色无法使用技能，包括主动技能、武器技能、额外技能以及特技。\n不同技能的判定时机略有不同，少部分有前摇的技能会在前摇结束后再次进行判定，若此时处于禁用技能效果期间，则技能仍然会被打断并返还CD。',
    detailedDescription:
      '使角色无法使用技能，包括主动技能、武器技能、额外技能以及特技。\n不同技能的判定时机略有不同，少部分有前摇的技能会在前摇结束后再次进行判定，若此时处于禁用技能效果期间，则技能仍然会被打断并返还CD。\n大部分时候该效果会在对应键位上显示"禁止"图标以作提示，但并不绝对。',
    stack: '同类效果持续时间互相独立，但只会同时生效一个。',
    source: [
      { name: '猛攻', type: 'knowledgeCard' },
      { name: '红色卡牌', type: 'entity' },
    ],
    unuseImage: true,
  },
  禁用道具: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#道具.*禁用', '#禁用.*道具'],
    description: '使角色无法主动拾取、投掷、使用或放下道具。',
    detailedDescription:
      '使角色无法主动拾取、投掷、使用或放下道具。\n大部分时候该效果会在对应键位上显示"禁止"图标以作提示，但并不绝对。',
    stack: '同类效果持续时间互相独立，但只会同时生效一个。',
    source: [{ name: '猛攻', type: 'knowledgeCard' }],
    unuseImage: true,
  },
  禁用爪刀: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['%缴械', '#爪刀.*禁用', '#禁用.*爪刀'],
    description: '使角色无法使用爪刀。',
    detailedDescription:
      '使角色无法使用爪刀。\n大部分时候该效果会在对应键位上显示"禁止"图标以作提示，但并不绝对。',
    stack: '同类效果持续时间互相独立，但只会同时生效一个。',
    source: [
      { name: '缴械', type: 'knowledgeCard' },
      { name: '贵族礼仪', type: 'skill' },
    ],
    unuseImage: true,
  },
  减少状态持续时间: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[(降低)(减少)].*持续时间', '#持续时间.*[(降低)(减少)]'],
    description:
      '降低指定状态的持续时间。若目标身上已有该状态，则该状态的剩余时间会立刻被重新计算。',
    source: [
      { name: '力大无穷', type: 'skill' },
      { name: '骄傲的学霸', type: 'skill' },
    ],
    unuseImage: true,
  },
  解除指定状态: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['%清除', '%解除', '#消除'],
    duration: 'disposable',
    description: '若目标角色身上有指定类型的状态，则立即解除它。',
    detailedDescription:
      '若目标角色身上有指定类型的状态，则立即解除它。部分复合了多种效果的状态在判定时，会以其主效果进行判定（效果类型和图标会显示在其状态栏）。',
    source: [
      { name: '净化萝卜', type: 'item' },
      { name: '警戒', type: 'skill' },
      { name: '药水', type: 'item' },
      { name: '绝处逢生', type: 'specialSkill' },
    ],
    unuseImage: true,
  },
  免疫指定状态: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#免疫'],
    description: '持续期间免受指定类型的状态效果；获得免疫效果前已经受到的状态效果不会解除。',
    stack: '各免疫效果间互不影响。',
    source: [
      { name: '无敌', type: 'skill' },
      { name: '霸体', type: 'skill' },
      { name: '鸟哨鞭炮', type: 'entity' },
      { name: '金币', type: 'entity' },
    ],
    unuseImage: true,
  },
  引燃速度改变: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['引线长度改变', '#引线长度', '#引燃速度', '#[(放飞)(火箭)(引线)].*倒计时'],
    description:
      '使{火箭}引线的燃烧速度按百分比数值改变，或使引线剩余长度（放飞剩余时间）按固定值改变。火箭基础引燃速度为1/秒。',
    stack: '所有固定值改变效果直接生效，百分比加速/减速效果[可叠加生效](具体计算方式待测试)。',
    source: [
      { name: '火箭', type: 'item' },
      { name: '加大火力', type: 'knowledgeCard' },
      { name: '蓝图火箭', type: 'entity' },
      { name: '友情庇护', type: 'skill' },
    ],
    unuseImage: true,
  },
  熄灭火箭: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[熄浇打]灭'],
    description:
      '使{火箭}引线熄灭，{引燃速度}变为0；猫靠近火箭后可通过交互将其点燃，恢复引燃速度并再次触发{绑上火箭}导致的引线长度缩短10秒效果。',
    source: [
      { name: '火箭', type: 'item' },
      { name: '爱之花洒', type: 'entity' },
      { name: '沙包拳头', type: 'skill' },
    ],
    unuseImage: true,
  },
  炸毁火箭: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#[炸摧]毁'],
    description:
      '直接摧毁{火箭}，并解救{被绑上火箭}的老鼠，被炸毁的火箭无法绑上老鼠；猫靠近火箭后可通过交互将其修复。',
    source: [
      { name: '火箭', type: 'item' },
      { name: '火药桶', type: 'entity' },
      { name: '共鸣', type: 'skill' },
    ],
    unuseImage: true,
  },
  阻止火箭放飞: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['阻止火箭起飞', '#阻止[(火箭)(队友)(老鼠)(友方)].*[(放飞)(起飞)]'],
    description:
      '使{火箭}引线燃烧至0时也不{起飞}，但通常无法阻止经典之家-杂货间炸药堆等方式导致的强制放飞。',
    source: [
      { name: '火箭', type: 'item' },
      { name: '兔子大表哥', type: 'entity' },
      { name: '友情庇护', type: 'skill' },
    ],
    unuseImage: true,
  },
  恢复: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#恢复', '持续恢复', '回血'],
    description: '使角色每隔一段时间（通常是每秒）增加一定Hp，但不会直接解除{虚弱}。',
    detailedDescription:
      '使角色每隔一段时间（通常是每秒）增加一定Hp，但不会直接解除{虚弱}。\n注：一部分{加速}、{霸体}状态也会应用恢复恢复的显示特效，需注意甄别。',
    stack: '在未特殊注明时，同名效果重复获得改为刷新持续时间，同类效果可叠加生效且互不影响。',
    source: [
      { name: '牛奶', type: 'item' },
      { name: '逃窜', type: 'knowledgeCard' },
    ],
    unuseImage: true,
  },
  持续受到伤害: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#持续.*[(伤害)(健康值)(Hp)(hp)(HP)]'],
    description: '使角色每隔一段时间（通常是每秒）减少一定Hp，，若Hp因此降低至0以下则进入{虚弱}。',
    stack: '在未特殊注明时，同名效果重复获得改为刷新持续时间，同类效果可叠加生效且互不影响。',
    source: [
      { name: '垃圾桶(衍生物)', type: 'entity' },
      { name: '牛仔吉他', type: 'skill' },
    ],
    unuseImage: true,
  },
  护盾: {
    type: '正面',
    global: false,
    target: '角色',
    description:
      '护盾能免疫一次负面状态（例如{常规眩晕}或{虚弱}等），但会消耗护盾层数，层数耗尽时护盾消失。部分护盾在抵挡指定类型的负面状态时不消耗层数。',
    stack: '部分护盾可叠加多层；各护盾效果间互不影响，且有各自的优先级，优先消耗优先级靠前的护盾。',
    source: [
      { name: '护盾药水', type: 'item' },
      { name: '护佑', type: 'knowledgeCard' },
      { name: '威严光盾', type: 'skill' },
    ],
    unuseImage: true,
  },
  无敌: {
    type: '正面',
    global: false,
    target: '角色',
    description:
      '无敌期间免疫绝大多数负面状态（例如{常规眩晕}或{虚弱}等）。该效果与{护盾}类似，但持续时间固定。',
    stack: '各效果间互不影响。',
    source: [
      { name: '发怒冲刺', type: 'skill' },
      { name: '国王权杖', type: 'skill' },
    ],
    unuseImage: true,
  },
  霸体: {
    type: '正面',
    global: false,
    target: '角色',
    aliases: ['#霸体$'],
    description: '免疫指定类型的状态效果。不同霸体效果免疫的范围不同。',
    detailedDescription:
      '免疫指定类型的状态效果。[不同霸体效果免疫的范围不同](推测这是因为霸体的免疫实际上由"白名单"实现，在这个名单上的状态均会被免疫，而不同霸体的白名单差异很大)。需注意即便是同类效果，霸体也有可能只能免疫其中的一至数种。',
    stack: '各效果间互不影响。',
    source: [
      { name: '绝地反击(特技)', type: 'specialSkill' },
      { name: '西部风情', type: 'skill' },
    ],
    unuseImage: true,
  },
  隐身: {
    type: '正面',
    global: false,
    target: '角色',
    description:
      '使自身角色模型对敌方变为全透明，对友方变为半透明。注意：部分特效仍然会保持原透明度，例如角色从高处落地时产生的"脚气"烟雾特效，{魅力香水}在自身周围的环绕特效等。',
    detailedDescription:
      '使自身角色模型（包括昵称及Hp条等）对敌方变为全透明，对友方变为半透明。此外隐身状态还能免疫部分状态效果，例如斯派克的抓取等。隐身会被部分覆盖范围较广的{霸体}效果免疫。注意：部分特效仍然会保持原透明度，例如角色从高处落地时产生的"脚气"烟雾特效，{魅力香水}在自身周围的环绕特效等。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    source: [
      { name: '魅力香水', type: 'entity' },
      { name: '隐身药水', type: 'item' },
      { name: '分身大师', type: 'skill' },
    ],
    unuseImage: true,
  },
  隐藏模型: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#隐藏.*模型', '%模型消失'],
    description:
      '使角色模型（包括昵称和Hp条）完全透明，且不再产生碰撞，但仍能被少部分范围类效果影响。',
    source: [{ name: '骑士连斩', type: 'skill' }],
    unuseImage: true,
  },
  受伤: {
    type: '负面',
    global: false,
    target: '角色',
    duration: 'infinite',
    failure: '得到队友治疗后',
    description:
      '自身[基础Hp恢复](不包括其它来源的恢复效果)强制归零，且{移速降低5%}。其它老鼠可通过交互键治疗受伤的老鼠，成功治疗时获得少量经验。',
    stack: '角色虚弱期间不会再次受到虚弱效果，也不会重置虚弱时间。',
    unuseImage: true,
  },
  鼠虚弱: {
    type: '负面',
    global: false,
    target: '角色',
    duration: 10,
    description: '禁用技能和道具，获得高额减速及跳跃高度降低，且可被{抓起}，持续10秒。',
    stack: '角色虚弱期间不会再次受到虚弱效果，也不会重置虚弱时间。',
    source: [
      { name: '铁血', type: 'knowledgeCard' },
      { name: '喜剧之王', type: 'skill' },
    ],
    unuseImage: true,
  },
  猫虚弱: {
    type: '负面',
    global: false,
    target: '角色',
    description:
      '禁用技能和道具，无法移动、跳跃，获得50Hp/秒的{恢复}效果。该效果结束时获得1秒无敌。',
    stack: '角色虚弱期间不会再次受到虚弱效果，也不会重置虚弱时间。',
    source: [{ name: '戏剧转折', type: 'skill' }],
    unuseImage: true,
  },
  反向: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#反向'],
    description:
      '立刻改变角色朝向，随后使左右移动键的效果互换，跳跃和{飞行}期间的上下移动不受影响。另外，反向大多伴随[视野扭曲](使角色视野以波浪形和固定的频率幅度进行扭曲)的效果，但并不绝对（由{2级感同身受}造成的反向除外）。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    source: [
      { name: '感同身受', type: 'skill' },
      { name: '香水瓶', type: 'item' },
      { name: '黄色卡牌', type: 'entity' },
      { name: '香水美人', type: 'skill' },
    ],
    unuseImage: true,
  },
  失明: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#失明', '%致盲'],
    description:
      '遮蔽角色周围小范围外的其他视野。另外，失明大多伴随隐藏小地图键的效果，但并不绝对。',
    stack: '同类效果持续时间互不影响，但效果无法叠加。',
    source: [
      { name: '胡椒瓶', type: 'item' },
      { name: '煎蛋', type: 'entity' },
      { name: '感同身受', type: 'skill' },
    ],
    unuseImage: true,
  },
  变身: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#变身'],
    description:
      '变身为指定类型的衍生物。变身分为两种：一种是通过对自身施加变身状态进行变身，另一种是隐藏自身模型，并改为操作另一种指定类型的衍生物。变身效果的优先级很高，通常不会因{霸体}、{虚弱}等效果而{免疫}。',
    detailedDescription:
      '变身为指定类型的衍生物。变身分为两种：\n1.通过对自身施加变身状态进行变身。这类变身效果持续期间受到的伤害和效果均会实时反映到角色本体上，此类包括：{变身饮料}、{头盔}、{大星星}、{小星星}、{线条猫}等。\n2.隐藏自身模型，临时切换自身键位，改为操作另一种指定类型的衍生物。这类变身效果的变身对象受到的伤害和效果不会对角色本体造成影响，但部分能对{模型消失}目标造成效果的技能仍能直接对本体造成影响：{机器鼠(衍生物)}、{战车}、{乾坤袋(NPC)(衍生物)}、盔甲人等。\n\n变身效果的优先级很高，通常不会因{霸体}、{虚弱}等效果而{免疫}。',
    stack: '角色同时只能处于一种变身效果下，因此持有变身效果时通常会{免疫变身}。',
    source: [
      { name: '变身饮料', type: 'item' },
      { name: '头盔', type: 'entity' },
      { name: '大星星', type: 'entity' },
      { name: '小星星', type: 'entity' },
      { name: '线条猫', type: 'entity' },
      { name: '机器鼠(衍生物)', type: 'entity' },
      { name: '战车', type: 'entity' },
      { name: '乾坤袋(NPC)(衍生物)', type: 'entity' },
    ],
    unuseImage: true,
  },
  眩晕: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#[^(硬直)(冰冻)(爆炸)(电击)(拍扁)(夹住)]眩晕*'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，眩晕同时具有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '花瓶', type: 'item' },
      { name: '金币', type: 'entity' },
      { name: '大铁锤', type: 'skill' },
    ],
  },
  硬直: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#硬直', '%僵直'],
    description:
      '无法移动、跳跃、使用技能和道具。与{眩晕}不同的是，硬直通常没有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '碎片', type: 'item' },
    ],
  },
  冰冻: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#冰冻'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，冰冻同时具有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
    ],
  },
  爆炸: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#爆炸'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，爆炸同时具有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '鞭炮', type: 'item' },
      { name: '火箭筒', type: 'entity' },
    ],
  },
  电击: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#电击'],
    description:
      '无法移动、跳跃、使用技能和道具，并**叠加**一层{感电}（感电会使电系伤害增加）。未特殊标注时，电击同时具有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '电风扇', type: 'item' },
      { name: '电球', type: 'entity' },
      { name: '迅', type: 'skill' },
    ],
  },
  拍扁: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#拍扁'],
    description:
      '无法移动、跳跃、使用技能和道具，且{可被直接抓起}。未特殊标注时，被拍扁同时具有掉落手中道具/老鼠的效果。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '拍子', type: 'skill' },
    ],
  },
  击退: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#击退'],
    description:
      '立刻受到一个一次性受力效果，随后进入保持惯性的{眩晕}状态。\n部分击退同时具有掉落手中道具/老鼠的效果，会特别进行标注。\n少部分击退具有额外修正机制：角色在因击退导致的眩晕期间再次受到{常规眩晕}，则该眩晕期间仍保持惯性；角色在击退过程期间运动距离达到一定长度时，会改为向反方向运动，至最初位置后停止。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
    source: [
      { name: '冰块', type: 'item' },
      { name: '小鞭炮', type: 'item' },
      { name: '鞭炮束', type: 'item' },
      { name: '灰花瓶', type: 'item' },
      { name: '蓝花瓶', type: 'item' },
      { name: '狗骨头', type: 'item' },
      { name: '剑客长枪', type: 'skill' },
      { name: '沙包拳头', type: 'skill' },
      { name: '瑜伽球', type: 'entity' },
      { name: '魔音贯耳', type: 'skill' },
    ],
    unuseImage: true,
  },
  夹住: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#夹住'],
    description:
      '无法移动、跳跃、使用技能和道具，只有通过挣扎键增加挣扎进度条，进度条充满时才能挣脱。未特殊标注时，被夹住同时具有掉落手中道具/老鼠的效果。',
    stack: '角色同时最多只会被一个物件夹住。',
    source: [
      { name: '夹子', type: 'skill' },
      { name: '泡泡', type: 'entity' },
      { name: '百科全书', type: 'entity' },
    ],
    unuseImage: true,
  },
  抓起: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#抓起'],
    description:
      '无法移动、跳跃、使用技能和道具，并{掉落手中道具}，只有通过挣扎键增加挣扎进度条，进度条充满时才能挣脱。',
    unuseImage: true,
  },
  绑上火箭: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#绑上?火箭'],
    description:
      '被绑上火箭的老鼠无法移动、跳跃、使用技能和道具，同时以1/秒的基础速度减少自身所在火箭的倒计时；每隔一段时间可通过挣扎键增加挣扎进度条，进度条充满时根据挣扎类型触发+5秒/+10秒/[直接挣脱](现版本只能通过"幸运"或梦游杰瑞-1级"梦中乐园"触发)的效果。绑上火箭时会自动触发{火箭引线长度缩短10秒}的效果。',
    source: [{ name: '火箭', type: 'item' }],
    unuseImage: true,
  },
  放飞: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#放飞', '%起飞'],
    description:
      '使鼠方角色离开游戏，无法继续操作角色。在经典模式中，猫咪使3只老鼠被放飞即可取得胜利。',
    source: [
      { name: '火箭', type: 'item' },
      { name: '天堂火箭', type: 'entity' },
    ],
    unuseImage: true,
  },
  可被直接抓起: {
    type: '负面',
    global: false,
    target: '角色',
    aliases: ['#直接抓起'],
    description: '猫咪使用爪刀命中可被直接抓起的老鼠时，会将其{抓起}。',
    unuseImage: true,
  },
  感电: {
    type: '特殊',
    global: false,
    target: '角色',
    duration: 9.9,
    description:
      '使受到的电击伤害增加，可叠加。感电结束时获得{电免疫}，免疫电击伤害。感电持续期间接触部分水地形会触发电爆，提前结束感电效果并对周围所有角色造成{电击}和电击伤害。',
    detailedDescription:
      '使受到的电击伤害增加15，可叠加。感电结束时获得5秒{电免疫}，免疫电击伤害。感电持续期间接触[部分水地形](包括经典之家-洗碗池、夏日游轮-喷泉、游乐场-水城水域、森林牧场-湖泊/牛棚水槽等)会触发电爆，提前结束感电效果并对周围所有角色造成短暂{电击}和25电击伤害。',
    stack: '可叠加，每次叠加时重置持续时间。',
    unuseImage: true,
  },
  电免疫: {
    type: '特殊',
    global: false,
    target: '角色',
    duration: 4.9,
    description: '免疫电击和电击伤害。',
    unuseImage: true,
  },
  牵引: {
    type: '特殊',
    global: false,
    target: '角色',
    aliases: ['#牵引'],
    description: '使目标持续受到向目标方向的拉力，直到到达指定位置。全过程期间完全失重。',
    detailedDescription:
      '使目标持续受到向目标方向的拉力，直到到达指定位置。全过程期间完全失重。\n另注：大部分牵引内置了保护机制，若长时间未到达终点则会将目标直接{传送}到对应位置。',
    source: [
      { name: '牛仔鞭索', type: 'skill' },
      { name: '猎', type: 'skill' },
      { name: '尼宝的朋友', type: 'entity' },
    ],
    unuseImage: true,
  },
  伤害保护: {
    type: '正面',
    global: true,
    target: '猫角色',
    aliases: ['#伤害保护', '伤害保护机制'],
    duration: 1,
    description:
      '每层该状态使受到的伤害降低20%。注：该状态提供的效果与减伤在叠加计算方式和生效范围上略有不同。游戏中有极少部分伤害会受减伤但不受伤害保护影响。',
    stack:
      '可叠加，每次叠加重置持续时间。当存在多层本效果时，先进行**乘算**后再作为一个独立的{减伤}参与伤害计算。',
    detailedStack:
      '可叠加，每次叠加重置持续时间。当存在多层本效果时，先进行**乘算**后再作为一个独立的{减伤}参与伤害计算，即本效果大多数情况下可等价为**一个**数值为0.8的n次方的{减伤}，其中n为效果层数。\n\n以下为通用的伤害计算规则：\n受双方增减伤影响：实际伤害=[基础伤害+角色基础攻击增伤[ 角色基础攻击增伤本质是固定值攻击增伤，只因会受百分比攻击增伤影响而导致计算过程不同。]×(1+百分比攻击增伤)+固定值攻击增伤-固定值攻击减伤]×(1-百分比攻击减伤-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n受目标增减伤影响：实际伤害=基础伤害×(1-百分比受击减伤)+固定值受击增伤-固定值受击减伤\n不受增减伤影响：实际伤害=基础伤害\n实际伤害最低为0，不会小于0。\n伤害转移效果在实际伤害计算完毕后再进行计算。',
    unuseImage: true,
  },
  连控保护: {
    type: '正面',
    global: true,
    target: '猫角色',
    aliases: ['#伤害保护'],
    duration: 1,
    description: '持有该状态时，使后续受到的{常规眩晕}时长降低70%。',
    stack: '不可叠加。',
    unuseImage: true,
  },
  队友的鼓励: {
    type: '正面',
    global: true,
    target: '鼠角色',
    failure: '所有友方均离开自身周围后',
    description: '使自身火箭救援速度和捕鼠夹挣脱速度增加20%。',
    stack: '不可叠加。',
    unuseImage: true,
  },
  推奶酪减伤: {
    type: '正面',
    global: true,
    target: '鼠角色',
    failure: '结束推奶酪状态时',
    description: '使自身获得12%的减伤。',
    unuseImage: true,
  },
  全局推速降低: {
    type: '负面',
    global: true,
    target: '鼠角色',
    aliases: ['全局推奶酪减速'],
    description:
      '有2个同类效果：\n1.对局前3分钟内：自身推奶酪速度降低20%。\n2.有队友被绑上火箭：自身推奶酪速度降低10%。',
    stack:
      '可与其它同类效果叠加，乘算。\n通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。计算公式：基础速度×(1+百分比加速)×(1-百分比减速)+固定值加速-固定值减速，其中百分比加/减速单位为%。',
    unuseImage: true,
  },
  全局推速提高: {
    type: '正面',
    global: true,
    target: '鼠角色',
    aliases: ['全局推奶酪加速'],
    description:
      '有3个同类效果：\n1.对局3分钟后：自身推奶酪速度提高20%。\n2.到达奶酪期最后1分30秒时，自身推奶酪速度提高50%，且免疫{恐吓}状态。\n3.到达奶酪期最后1分30秒且已推入4块奶酪时，自身推奶酪速度提高到原本的3倍。\n（注意：后2个效果与[游戏内的原描述](原本描述：对局剩余1分30秒时，大幅提高最后一块奶酪的推进速度，并免疫恐吓效果。)不符）',
    stack:
      '可与其它同类效果叠加，其中前两种全局推速提高效果为正常乘算，第三种效果虽然为乘算，但**后于其它效果结算**。\n通常来说，数值的固定值与百分比形式互相独立，[各自结算](固定值效果直接加算，百分比效果先各自+100%后再乘算，最终结果再-100%)，而后分别作为一个整体带入计算公式中。先结算百分比效果，后结算固定值效果。计算公式：基础速度×(1+百分比加速)×(1-百分比减速)+固定值加速-固定值减速，其中百分比加/减速单位为%。第三种全局推速提高效果则是在其它所有同类效果全部结算完毕后，再在计算结果上进行结算。',
    source: [{ name: '恐吓', type: 'knowledgeCard' }],
    unuseImage: true,
  },
  复活: {
    type: '特殊',
    global: false,
    target: '角色',
    failure: 'Hp归零时',
    description: '重新返回局内，但Hp归零时被真正放飞。',
    source: [
      { name: '天使祝福', type: 'skill' },
      { name: '喜剧之王', type: 'skill' },
    ],
    unuseImage: true,
  },
  鱼钩眩晕: {
    type: '特殊',
    global: false,
    target: '角色',
    failure: '鱼钩的牵引结束时自动解除',
    description:
      '无法移动、跳跃，禁用道具、技能、爪刀，若为敌方则使其掉落手中老鼠。该效果与{眩晕}类似，但不会在头顶显示为眩晕，且由于并非"负面状态"而不会被大部分{护盾}、{无敌}、{霸体}效果抵挡，也无法清空{魅惑之吻}造成的吻痕效果等。',
    source: [{ name: '尼宝的朋友', type: 'entity' }],
    unuseImage: true,
  },
  飞行: {
    type: '特殊',
    global: false,
    target: '角色',
    description:
      '完全失重，移动方式切换至摇杆，可通过摇杆向斜向的四个方向进行移动，陷入{无法移动}效果时仍可进行上下移动。进入飞行状态时若未松开方向键，则会[暂时保持方向键的移动方式](键位仍会切换至摇杆，但只能进行左右方向的移动)，直到松开移动键。',
    source: [
      { name: '自由翱翔', type: 'skill' },
      { name: '战术机动', type: 'skill' },
    ],
    unuseImage: true,
  },
};

const buffsWithImages: Record<string, Buff> = Object.fromEntries(
  Object.entries(buffDefinitions).map(([buffName, buff]) => [
    buffName,
    {
      ...buff,
      name: buffName,
      imageUrl: getBuffImageUrl(buffName, buff),
    },
  ])
);

export default buffsWithImages;
