import { Buff, BuffDefinition } from './types';

export const getBuffImageUrl = (name: string, buff: BuffDefinition): string => {
  if (!!buff.specialImageUrl) return buff.specialImageUrl;
  if (buff.unuseImage)
    return `/images/buffs/default-${buff.bufftype == '负面效果' ? 'debuff' : 'buff'}.png`;
  return `/images/buffs/${encodeURIComponent(name)}.png`;
};

const buffDefinitions: Record<string, BuffDefinition> = {
  眩晕: {
    bufftype: '负面效果',
    correlations: ['{硬直}', '{冰冻}', '{爆炸}', '{电击}', '{被拍扁}'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，眩晕同时具有{击落手中道具/老鼠}的效果。硬直、冰冻、爆炸、电击、被拍扁等状态亦属于眩晕，但特性有所不同。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
  硬直: {
    bufftype: '负面效果',
    aliases: ['眩晕'],
    correlations: ['{眩晕}'],
    description:
      '无法移动、跳跃、使用技能和道具。与眩晕不同的是，硬直通常没有{击落手中道具/老鼠}的效果。硬直亦属于眩晕，但特性有所不同。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
  冰冻: {
    bufftype: '负面效果',
    aliases: ['眩晕'],
    correlations: ['{眩晕}'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，冰冻同时具有{击落手中道具/老鼠}的效果。冰冻亦属于眩晕。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
  爆炸: {
    bufftype: '负面效果',
    aliases: ['眩晕'],
    correlations: ['{眩晕}'],
    description:
      '无法移动、跳跃、使用技能和道具。未特殊标注时，爆炸同时具有{击落手中道具/老鼠}的效果。爆炸亦属于眩晕。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
  电击: {
    bufftype: '负面效果',
    aliases: ['眩晕'],
    correlations: ['{眩晕}'],
    description:
      '无法移动、跳跃、使用技能和道具，并**叠加**一层{感电}（感电会使电系伤害增加）。未特殊标注时，电击同时具有{击落手中道具/老鼠}的效果。电击亦属于眩晕，但特性有所不同。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
  被拍扁: {
    bufftype: '负面效果',
    aliases: ['眩晕'],
    correlations: ['{眩晕}'],
    description:
      '无法移动、跳跃、使用技能和道具，且被爪刀命中时改为被{直接抓起}。未特殊标注时，被拍扁同时具有{击落手中道具/老鼠}的效果。被拍扁亦属于眩晕，但特性有所不同。',
    stack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由**部分道具及极少部分技能**导致的眩晕时，免疫其它来自这些道具的眩晕。',
    detailedStack:
      '通常情况下各眩晕效果间互不影响，但当角色处于由{冰块}/{小鞭炮}/{鞭炮束}/{灰花瓶}/{蓝花瓶}/{狗骨头}/{2级剑客长枪}（蓄力超过2/3但未到最大值时）/{沙包拳头}（满怒游龙拳击退撞到道具）导致的眩晕时，免疫其它来自这些道具的眩晕。',
  },
};

const buffsWithImages: Record<string, Buff> = Object.fromEntries(
  Object.entries(buffDefinitions).map(([buffName, buff]) => [
    buffName,
    {
      ...buff,
      name: buffName,
      imageUrl: getBuffImageUrl(buffName, buff),
    },
  ])
);

export default buffsWithImages;
