import { Item, ItemDefinition } from './types';

export const getItemImageUrl = (name: string): string => {
  return `/images/items/${encodeURIComponent(name)}.png`;
};

const damage50Object = {
  itemtype: '投掷类' as const,
  itemsource: '常规道具' as const,
  damage: 50,
  description: '击中敌人时造成减速以及50点伤害，击中地面时生成数个碎片。',
  create: '自然刷新。',
};

const itemDefinitions: Record<string, ItemDefinition> = {
  /* ----------------------------------- 投掷类常规道具 ----------------------------------- */
  盘子: Object.assign(
    {
      aliases: ['圆盘子'],
      walldamage: 5,
      store: true,
      price: 500,
      storeCD: 90,
    },
    damage50Object
  ),
  扁盘: Object.assign(
    {
      aliases: ['盘子', '碟子'],
      walldamage: 8,
      store: false,
    },
    damage50Object
  ),
  玻璃杯: Object.assign(
    {
      aliases: ['杯子'],
      walldamage: 5,
      store: true,
      price: 500,
      storeCD: 90,
    },
    damage50Object
  ),
  碗: Object.assign(
    {
      walldamage: 6,
      store: false,
    },
    damage50Object
  ),
  叉子: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['餐叉', '铁叉'],
    damage: 25,
    walldamage: 5,
    description:
      '击中敌人时造成减速以及25点伤害，击中地面或墙壁时（部分墙壁和地面除外）插在对应平面上，阻碍角色通行，可通过交互键拔下，或受到来自下方的3次碰撞后顶飞。',
    create: '自然刷新，当对局中存在人工智能角色时则不刷新。',
    store: false,
  },
  高尔夫球: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['高尔夫', '球'],
    damage: 25,
    walldamage: 3,
    description: '击中敌人时造成减速以及25点伤害，可反复弹跳。',
    create: '自然刷新。',
    store: true,
    price: 1500,
    storeCD: 180,
    teamCD: true,
  },
  香水瓶: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['香水'],
    damage: 0,
    walldamage: 8,
    description:
      '击中敌人时造成反向，击中地面时生成香水区域(碰触的角色会反向，60秒后或被碰触5次后消失)。',
    create: '自然刷新。',
    store: true,
    price: 500,
    storeCD: 120,
  },
  胡椒瓶: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['烟雾', '胡椒粉', '烟雾瓶'],
    damage: 0,
    walldamage: 8,
    description:
      '击中敌人时造成致盲，击中地面时生成烟雾区域(碰触的角色会致盲，60秒后或被碰触5次后消失)。',
    create: '自然刷新。',
    store: true,
    price: 500,
    storeCD: 120,
  },
  番茄: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['大番茄', '西红柿'],
    damage: 0,
    walldamage: 3,
    description:
      '击中敌人时造成减速，击中地面时生成番茄区域（碰触到的角色会减速，可叠加，可影响火箭上的老鼠，一段时间或碰触数次后消失）。',
    create: '自然刷新。',
    store: false,
  },
  冰块: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['冰'],
    damage: 25,
    walldamage: 3,
    description:
      '击中敌人或队友时造成2.4秒眩晕以及25点伤害，击中地面时生成冰面(碰触的角色将会在其上滑行，60秒后或被碰触5次后消失)。拿在手中时会倒计时5秒，倒计时结束时对自身造成2.4秒冻结及25点伤害，放下后重置倒计时。角色处于由冰块/鞭炮/花瓶导致的眩晕时，不会再次受到来自它们的眩晕。',
    create: '自然刷新，或从冰桶中拾取得到。',
    store: true,
    price: 1300,
    storeCD: 180,
  },
  小鞭炮: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['鞭炮', '小鞭炮', '炸药'],
    damage: 75,
    walldamage: 7,
    description:
      '拿在手中时可以点燃，点燃5秒后爆炸，对周围所有目标造成2秒眩晕和75点伤害（不受攻击增伤影响）。拿在手中时可通过喝饮料重置倒计时。角色处于由冰块/鞭炮/花瓶导致的眩晕时，不会再次受到来自它们的眩晕。',
    create: '自然刷新，或从鞭炮堆中拾取得到。',
    store: true,
    price: 600,
    storeCD: 180,
    unlocktime: '奶酪期 10:00',
  },
  鞭炮束: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['鞭炮', '大鞭炮', '核弹头', '炸药'],
    damage: 75,
    walldamage: 4,
    description:
      '拿在手中时可以点燃，点燃5秒后爆炸，对周围所有目标造成2秒眩晕和75点伤害（不受攻击增伤影响），并分裂出6个小鞭炮，各自延迟1秒后爆炸，对周围所有目标造成2秒眩晕和75点伤害（不受攻击增伤影响，没有伤害来源）。拿在手中时可通过喝饮料重置倒计时。角色处于由冰块/鞭炮/花瓶导致的眩晕时，不会再次受到来自它们的眩晕。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: true,
    price: 2400,
    storeCD: 120,
    unlocktime: '墙缝期 03:30',
  },
  灰花瓶: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: [
      '花瓶',
      '灰色花瓶',
      '灰罐子',
      '灰色大花瓶',
      '灰缸',
      '黑色花瓶',
      '黑罐子',
      '黑色大花瓶',
    ],
    damage: 50,
    walldamage: 8,
    description:
      '击中敌人时造成2.8秒眩晕以及50点伤害，击中地面时生成数个碎片。角色处于由冰块/鞭炮/花瓶导致的眩晕时，不会再次受到来自它们的眩晕。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: true,
    price: 1600,
    storeCD: 240,
  },
  蓝花瓶: {
    itemtype: '投掷类' as const,
    itemsource: '常规道具' as const,
    aliases: ['花瓶', '蓝白花瓶', '蓝罐子', '蓝白大花瓶', '蓝缸'],
    damage: 50,
    walldamage: 8,
    description:
      '击中敌人时造成2.8秒眩晕以及50点伤害，击中地面时生成数个碎片。可将至多3个其他投掷类常规道具（不包括番茄和其他蓝花瓶）装入蓝花瓶内，击中敌人或地面时使花瓶内的道具掉出，造成对应效果。角色处于由冰块/鞭炮/花瓶导致的眩晕时，不会再次受到来自它们的眩晕。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: true,
    price: 2400,
    teamCD: true,
  },
  /* ----------------------------------- 手持类常规道具 ----------------------------------- */
  遥控器: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    damage: 75,
    description:
      '猫/鼠使用后召唤对应的机械猫/鼠，撞到对方阵营角色时爆炸，对周围的对方阵营角色造成2.3秒眩晕和75伤害。',
    create: '自然不刷新，只能通过纸盒/小黄鸭（鼠）/传送带/彩蛋房等途径获得。',
    store: false,
  },
  玩具枪: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    damage: 50,
    walldamage: 6,
    description:
      '可以使用五次，每次使用发射一颗子弹，对命中的敌方造成伤害和高额减速效果，对命中的墙缝造成伤害。',
    create: '自然不刷新，只能通过纸盒/小黄鸭（鼠）/传送带/彩蛋房，或从商店购买等途径获得。',
    store: true,
    price: 5000,
    storeCD: 180,
    teamCD: true,
  },
  老鼠夹: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat',
    aliases: ['夹子', '捕鼠夹'],
    description:
      '手持使用时在原地布下老鼠夹，夹住触碰的角色，使其无法移动和使用技能。猫咪的挣脱速度要快于老鼠，但猫咪在虚弱时无法挣扎。',
    create:
      '自然刷新。游戏开始时每个房间最多刷新2个老鼠夹，单个房间老鼠夹、苍蝇拍的数量不会超过3个但也不会低于1个。',
    store: true,
    price: 1800,
    storeCD: 150,
  },
  苍蝇拍: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat',
    aliases: ['拍子'],
    damage: 25,
    description:
      '手持时略微增加攻击距离。可以使用两次，在0.5秒前摇后对攻击范围内所有老鼠造成2.3秒眩晕和25伤害，老鼠在该眩晕期间被爪刀命中会被直接抓起。苍蝇拍使用间隔为2秒。使用过程中被打断不会返还使用次数。',
    detailedDescription:
      '手持时略微增加攻击距离。可以使用两次，在0.5秒前摇后对攻击范围内所有老鼠造成两次眩晕（一次0.9秒一次2.3秒，原因不详）和25伤害，老鼠在该眩晕期间被爪刀命中会被直接抓起。苍蝇拍使用间隔为2秒（该间隔会显示在爪刀键上，但不影响爪刀的冷却和使用）。知识卡-长爪会使拍子的伤害强制归零，但仍有控制和使老鼠受伤的效果。使用过程中被打断不会返还使用次数。',
    create:
      '自然刷新。游戏开始时每个房间最多刷新1个苍蝇拍，单个房间捕鼠夹、苍蝇拍的数量不会超过3个但也不会低于1个。',
    store: true,
    price: 2300,
    storeCD: 240,
  },
  修理锤: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat',
    aliases: ['锤子'],
    description:
      '可以使用3次，只能对墙缝使用，每次使用使墙缝Hp增加10，并且受到的伤害降低40%，持续10秒。使用过程中被打断不会返还使用次数。', //前摇数据待补充
    create: '只在墙缝期自然刷新，在2只及以上老鼠存活时刷新1个，刷新时会在小地图上显示位置10秒。',
    store: true,
    price: 2600,
    storeCD: 180,
    unlocktime: '墙缝期 03:50',
  },
  黄金修理锤: {
    itemtype: '手持类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat',
    aliases: ['金锤子'],
    description:
      '只可使用1次，只能对墙缝使用，每次使用使墙缝无敌10秒。使用过程中被打断会返还使用次数。', //前摇数据待补充
    create:
      '只在墙缝期自然刷新，只有在4只老鼠均存活时才会刷新1个，刷新时会在小地图上显示位置10秒。',
    store: false,
  },
  /* ----------------------------------- 物件类常规道具 ----------------------------------- */
  泡泡机: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat',
    description:
      '猫咪交互后获得一个泡泡，同时向墙缝飘出一个泡泡，泡泡可抵御伤害，可被攻击，被击破时爆炸对周围角色造成2秒眩晕和50伤害。泡泡机有30秒CD。猫咪身上有泡泡时免疫控制效果；飞向墙缝的泡泡受到的伤害提高100%，但爆炸时不会对周围持有泡泡的猫咪造成影响。',
    create:
      '只在墙缝期自然刷新，只有在3只及以上老鼠存活时才会刷新1个，猫咪始终能从小地图上看到泡泡机的位置。',
    store: true,
    price: 3200,
    storeCD: 180,
    unlocktime: '墙缝期 03:30',
  },
  水果盘: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['果盘'],
    walldamage: 0.5,
    description:
      '与其交互可从自身所在位置向面朝方向以固定角度投出1个果子，累计投出10个果子后进入10秒冷却。果子命中敌方造成高额减速，命中墙缝造成0.5伤害。每轮果子中的后9个果子无法受到知识卡-破墙的加成。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。墙缝刷新时极大概率在其附近刷新至少1个果盘。',
    store: true,
    price: 3200,
    storeCD: 180,
    unlocktime: '墙缝期 03:50',
    teamCD: true,
  },
  冰桶: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['冰块桶'],
    description:
      '可从中取出冰块，第一次取出时冷却为10秒，此后每次增加3秒，至多25秒。猫从鞭炮堆中取鞭炮的速度比老鼠快。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: true,
    price: 2800,
    storeCD: 240,
    unlocktime: '奶酪期 08:00',
    teamCD: true,
  },
  鞭炮堆: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['鞭炮桶', '小鞭炮堆'],
    description:
      '可从中取出小鞭炮，第一次取出时冷却为10秒，此后每次增加3秒，至多25秒。猫从鞭炮堆中取鞭炮的速度比老鼠快。',
    create:
      '自然刷新，每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: true,
    price: 1600,
    storeCD: 120,
  },
  面粉袋: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['面粉'],
    description:
      '与面粉袋交互后生成面粉区域，遮挡位于其中的角色和道具，并使触碰的角色获得面粉效果（40秒内不会在敌方小地图上显示位置，且开关门没有声音）。进入森林牧场的湖泊区域时立刻清除面粉效果。',
    create: '自然刷新',
    store: false,
  },
  小纸盒: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['纸盒', '纸箱', '小纸箱', '纸袋', '小纸袋'],
    description:
      '小一些的纸盒，与其交互可以打开纸盒，随机掉落一个常规道具（包括所有投掷类道具，除了修理锤及黄金修理锤外的其他手持类道具，以及牛奶、蛋糕、神秘饮料、奶酪）。',
    create: '自然刷新。',
    store: false,
  },
  大纸盒: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['纸盒', '纸箱', '大纸箱', '纸袋', '大纸袋'],
    description:
      '大一些的纸盒，与其交互可以打开纸盒，随机掉落一个常规道具（包括所有投掷类道具，除了修理锤及黄金修理锤外的其他手持类道具，以及牛奶、蛋糕、神秘饮料、奶酪）。',
    create: '自然刷新。',
    store: false,
  },
  空投包裹: {
    itemtype: '物件类' as const,
    itemsource: '常规道具' as const,
    aliases: ['空投', '鸟包'],
    description:
      '与其交互可以打开包裹，随机掉落两个稀有道具（包括玩具枪、苍蝇拍和全部六种饮料）。空投始终会显示在小地图上。',
    create:
      '只能通过金丝雀掉落，可以用道具击打金丝雀使其提前掉落包裹。金丝雀出现时会显示在小地图上。',
    store: false,
  },
  /* ----------------------------------- 食物类常规道具 ----------------------------------- */
  牛奶: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    description:
      '与其交互可以食用，食用需要3.55秒(猫)/4.65秒(鼠)，食用后恢复50Hp并解除受伤，使移速提高20%，Hp恢复提高2.5/秒，持续20秒。',
    create: '自然刷新。',
    store: true,
    price: 400,
    storeCD: 120,
  },
  蛋糕: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    description:
      '与其交互可以食用，食用需要3.55秒(猫)/4.65秒(鼠)，食用后恢复50Hp并解除受伤，使所有冷却中的技能减少40%的最大CD(包括主动、武器技能，以及特技、知识卡、被动及进入机械鼠等额外技能)。',
    detailedDescription:
      '与其交互可以食用，食用需要3.55秒(猫)/4.65秒(鼠)，食用后恢复50Hp并解除受伤，并且使所有冷却中的技能减少40%的最大CD(包括主动、武器技能，以及特技、知识卡、被动及进入机械鼠等额外技能)。对于多元乱斗中和20240711更新前放在自定义地图中的蛋糕，其效果改为恢复75Hp并提高跳跃高度。',
    create: '自然刷新。',
    store: true,
    price: 500,
    storeCD: 120,
  },
  远视饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: ['远视药水', '蓝色药水'],
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复75Hp(猫)/50Hp(鼠)并解除受伤，获得60秒(猫)/40秒(鼠)远视效果（提高视野范围），在小地图上显示所有敌方角色的位置10秒(猫)/5秒(鼠)并使敌方的“不会在小地图上显示”效果暂时失效。',
    detailedDescription:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复75Hp(猫)/50Hp(鼠)并解除受伤，获得60秒(猫)/40秒(鼠)远视效果（提高视野范围，但持续期间无法获得其他视野提升效果，或是会被其他视野提升效果覆盖），在小地图上显示所有敌方角色的位置10秒(猫)/5秒(鼠)并使敌方的“不会在小地图上显示”效果暂时失效。',
    create:
      '自然刷新，且游戏开始时刷新的饮料，除1瓶隐身饮料、1瓶护盾饮料和1瓶神秘饮料外，其他均为远视饮料。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 2000,
    storeCD: 180,
  },
  隐身饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: ['隐身药水', '紫色药水'],
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp(猫)/25Hp(鼠)并解除受伤，获得50秒(猫)/30秒(鼠)隐身效果（隐藏绝大部分角色模型，使敌方无法直接看到自身，但落地时产生的烟雾仍能被敌方看到）。隐身期间老鼠进行火箭救援将减少5秒持续时间，将猫打至虚弱将结束隐身；猫把老鼠打至虚弱将减少10秒持续时间。',
    detailedDescription:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp(猫)/25Hp(鼠)并解除受伤，获得50秒(猫)/30秒(鼠)隐身效果（隐藏绝大部分角色模型，使敌方无法直接看到自身，但落地时产生的烟雾仍能被敌方看到，部分技能模型仍能被敌方看到，且隐身不免疫部分从小地图上直接看到其他角色的效果。当穿着3S/3SP级别的皮肤时，隐身后他人视角下落地产生的烟雾将替换为默认模型。若设置中开启“足迹全局可见”，则隐身时“足迹”仍能被敌方看到）。隐身期间老鼠进行火箭救援将减少5秒持续时间，将猫打至虚弱将结束隐身；猫把老鼠打至虚弱将减少10秒持续时间。',
    create: '自然刷新，且游戏开始时会且仅会刷新1瓶。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 2900,
    storeCD: 240,
  },
  护盾饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: ['护盾药水', '绿色药水'],
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp(猫)/25Hp(鼠)并解除受伤，获得两层(猫)/一层(鼠)护盾，持续90秒(猫)/30秒(鼠)。踩到碎片不会破除护盾，但会减少其5秒持续时间。',
    create: '自然刷新，且游戏开始时会且仅会刷新1瓶。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 2600,
    storeCD: 240,
  },
  兴奋饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: ['兴奋药水', '攻击药水', '力量药水', '红色药水'],
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp(猫)/25Hp(鼠)并解除受伤，提高100(猫)/50(鼠)攻击增伤，持续40秒(猫)/20秒(鼠)。',
    create: '自然刷新，但游戏开始时不会刷新。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 2800,
    storeCD: 180,
    unlocktime: '墙缝期 03:30',
  },
  变身饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: [
      '变身药水',
      '变大药水',
      '变壮药水',
      '力量药水',
      '比利鼠药水',
      '比例鼠药水',
      '绿色药水',
    ],
    damage: 50,
    walldamage: 2.5,
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp并解除受伤，鼠饮用后获得持续25秒的变身效果（无敌，清除其他护盾效果且无法进行交互。可通过投掷物按键进行攻击，对猫咪造成50伤害和一定减速效果，对墙缝造成2.5伤害，攻击CD为2秒），猫饮用后获得持续50秒的全面强化效果（增加攻击距离、移速提高20%、跳跃高度提高，爪刀命中的基础CD更改为2秒，不会被斯派克和机械鼠（道具）锁定，该效果在抓起老鼠时提前取消）。',
    detailedDescription:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后恢复50Hp并解除受伤，鼠饮用后获得持续25秒的变身效果（无敌，清除其他护盾效果且无法进行交互。可通过投掷物按键进行攻击，对猫咪造成50伤害和一定减速效果，对墙缝造成2.5伤害，对泡泡固定造成7伤害，攻击CD为2秒），猫饮用后获得持续50秒的全面强化效果（增加攻击距离、移速提高20%、跳跃高度提高，爪刀命中的基础CD更改为2秒，不会被斯派克和机械鼠（道具）锁定，该效果在抓起老鼠时提前取消）。',
    create: '自然刷新，但游戏开始时不会刷新。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 3600,
    storeCD: 180,
    unlocktime: '墙缝期 03:30',
    teamCD: true,
  },
  神秘饮料: {
    itemtype: '食物类' as const,
    itemsource: '常规道具' as const,
    aliases: ['神秘药水', '随机饮料', '随机药水', '彩色药水', '五颜六色的变大药水'],
    description:
      '拾取后储存在饮料栏，饮用需要2.9秒(猫)/2.45秒(鼠)，饮用后随机获得远视、隐身、护盾、兴奋、变身药水中的一个效果,各效果获得概率均等（恢复效果的数值取决于对应饮料的效果）。',
    create: '自然刷新，且游戏开始时会且仅会刷新1瓶。也可以通过空投包裹、商店、彩蛋房等途径获得。',
    store: true,
    price: 2200,
    storeCD: 180,
    teamCD: true,
  },
  /* ----------------------------------- 流程类常规道具 ----------------------------------- */
  奶酪: {
    itemtype: '流程类' as const,
    itemsource: '常规道具' as const,
    factionId: 'mouse' as const,
    description:
      '拾取后降低移速和视野范围，被投掷时的速度较低。投掷到空置的洞口内时会自动填入，然后可以推奶酪。',
    create:
      '在不同学业等级的地图中的刷新方式有所不同。对于大师学业：开局时随机在3个房间刷新奶酪，推入第2/3块奶酪时再在随机房间刷新奶酪，已刷新过奶酪的房间不会重复刷新。也可以通过开启纸盒，商店购买等方式获得。',
    store: true,
    price: 2800,
    storeCD: 120,
    unlocktime: '奶酪期 08:00',
  },
  火箭: {
    itemtype: '流程类' as const,
    itemsource: '常规道具' as const,
    factionId: 'cat' as const,
    description:
      '猫咪抓住老鼠时，可以与火箭交互将老鼠绑上；老鼠被绑上火箭时，其他老鼠可以通过交互将其救下。火箭初始倒计时60秒，有老鼠被绑上时该倒计时会立刻减少10秒，随后以1/秒的基础速度减少，当倒计时归零时火箭放飞，淘汰对应老鼠。老鼠在火箭上时可以通过挣扎增加倒计时，挣扎图标分三种：奶酪：倒计时增加5秒；牛排：倒计时增加10秒；星星棒：直接挣脱，但只能通过知识卡-幸运触发。墙缝期（包括推入第5块奶酪后至墙缝出现前的过渡期）的火箭燃烧速度大幅加快。',
    detailedDescription:
      '猫咪抓住老鼠时，可以与火箭交互将老鼠绑上；老鼠被绑上火箭时，其他老鼠可以通过交互将其救下。火箭初始倒计时60秒，有老鼠被绑上时该倒计时会立刻减少10秒，随后以1/秒的基础速度减少，当倒计时归零时火箭放飞（若老鼠正在进行救援，则不会放飞），淘汰对应老鼠。老鼠在火箭上时可以通过挣扎增加倒计时，挣扎图标分三种：奶酪：倒计时增加5秒,挣扎速度较快；牛排：倒计时增加10秒，挣扎速度适中；星星棒：直接挣脱，但挣扎速度较慢，且只能通过知识卡-幸运触发。若火箭因部分技能效果熄灭，则倒计时速度强制归零，且不会放飞，此时猫可以靠近对其进行点燃，点燃火箭同样会使倒计时立刻减少10秒。墙缝期（包括推入第5块奶酪后至墙缝出现前的过渡期）的火箭燃烧速度大幅加快。',
    create:
      '在不同学业等级的地图中的刷新方式有所不同。对于大师学业：在每张地图的固定火箭位置刷新火箭，在刷新奶酪的房间同步刷新1个火箭（包括初始刷新的3块奶酪及推入第2/3块奶酪时出现的第4/5块奶酪），在刷新墙缝的房间同步刷新大量火箭。也可以通过商店购买等方式获得。',
    store: true,
    price: 3200,
    storeCD: 210,
    unlocktime: '奶酪期 08:00',
  },
  /* ----------------------------------- 其它常规道具 ----------------------------------- */
  拳套盒: {
    itemtype: '其它' as const,
    itemsource: '常规道具' as const,
    aliases: ['拳套盒子', '拳头', '拳套'],
    description:
      '有角色路过时，在短暂延迟后向左、上、右之中的随机一个方向出拳，造成眩晕（可击落道具和老鼠）和25伤害。猫咪可通过交互键拆卸拳套盒并拿在手中，老鼠可通过交互将其缓慢向一个方向推行。',
    create:
      '只能通过自然刷新。每个房间初始最多刷新以下道具中的一个：果盘，冰桶，鞭炮堆，灰花瓶，蓝花瓶，拳套盒，鞭炮束。',
    store: false,
  },
  电风扇: {
    itemtype: '其它' as const,
    itemsource: '常规道具' as const,
    aliases: ['风扇'],
    description:
      '初始可被任意角色拾取。未被拾取时，每3秒向道具面朝方向吹起长度约为680的强风，持续击退范围内的其他角色和道具，强风持续3秒（结束吹风后等待3秒进行下一次吹风）。电风扇受到其他角色用道具或爪刀进行的攻击时强制进行3秒吹风，之后损毁变为报废电风扇，角色碰触时受到电击伤害，报废电风扇一段时间后或被碰触5次后消失。', //待补充
    create: '只能通过打开小纸盒或大纸盒获得，概率较低。',
    store: false,
  },
  净化萝卜: {
    itemtype: '其它' as const,
    itemsource: '常规道具' as const,
    aliases: ['萝卜', '纯净萝卜', '白花', '纯白之花'],
    description:
      '通过交互使用净化萝卜，使用后清除所有对立阵营角色身上的饮料效果（包括由饮料获得的远视、隐身、护盾、兴奋、变身效果），有120秒使用CD（处于可使用状态时为一整根在地上的萝卜，处于不可使用状态时为一个萝卜坑）。',
    create: '只能通过商店购买获得。',
    store: true,
    price: 2600,
    storeCD: 180,
  },
  /* ----------------------------------- 地图道具 ----------------------------------- */
  狗骨头: {
    itemtype: '投掷类' as const,
    itemsource: '地图道具' as const,
    aliases: ['骨头'],
    damage: 50,
    description:
      '击中敌人时造成眩晕以及50点伤害。掉落到地面时召唤小泰克，根据召唤者的阵营获得以下能力：猫：自动寻找老鼠进行攻击，造成眩晕和伤害；自动寻找有老鼠被绑上的火箭，对其进行鼓舞，增加引线燃烧速度。鼠：自动寻找猫咪进行攻击，造成眩晕和伤害；自动寻找正在推奶酪的老鼠，对其进行鼓舞，增加推奶酪速度。小泰克一段时间后消失，若正在进行鼓舞则暂时不会消失。',
    create: '击倒斯派克后掉落，若游戏内已存在其他狗骨头/小泰克，则不掉落。',
  },
  竹笋: {
    itemtype: '物件类' as const,
    itemsource: '地图道具' as const,
    aliases: ['笋'],
    description:
      '可被大熊猫或小熊猫拾取并吃掉，触发对应效果。鼠方可通过交互将其缓慢向一个方向推行。当自身因受外力而被动滑行时，会眩晕并击退碰到自身的老鼠。',
    create: '在熊猫馆地图中的熊猫谷和熊猫家园的固定位置刷新，或通过商店购买。',
    store: true,
    price: 2000,
    storeCD: 120,
    teamCD: true,
  },
  /* ----------------------------------- 技能道具 ----------------------------------- */
};

const itemsWithImages: Record<string, Item> = Object.fromEntries(
  Object.entries(itemDefinitions).map(([itemName, item]) => [
    itemName,
    {
      ...item,
      name: itemName,
      imageUrl: getItemImageUrl(itemName),
    },
  ])
);

export default itemsWithImages;
