import { Trait } from './types';

const traits: Trait[] = [
  /**
   * 备忘
   * 该文件的数据存储格式与其它data不同（因为特性不需要命名）
   * 一条特性包括group，description和isMinor（可选）。其中group由若干个singleItem（即{name,type,factionId?}）组成
   * 可以用[]框选数个singleItem形成singleItem[]，代表“或”，也就是“其中之一”。[]最多嵌套一层。
   * type='itemGroup'时，代表加入组合，组合会在索引判定时进行拆解，在显示时只显示名称。组合不支持与[]进行嵌套
   * singleItem的name不要用别名
   * factionId仅用于区分特技里的两个急速翻滚/应急治疗，因此平时不需要填写
   *
   * 编写有持有者的衍生物时建议同时加上它的所属技能（不用加所属角色），并应用[]格式
   * 文件内分类原则：group内有明确的角色/技能/有持有者的衍生物时，归属到它所属者之一的条目下即可。如果不确定是否已收录，可以在网站上查看一下有没有相关信息，或在文件内查找，避免重复*/
  //----------------------------------汤姆--------------------------------------------/
  {
    group: [
      { name: '发怒冲刺', type: 'skill' },
      { name: '番茄', type: 'item' },
    ],
    description: '发怒冲刺无法解除番茄带来的减速效果。',
  },
  {
    group: [
      { name: '发怒冲刺', type: 'skill' },
      [
        { name: '尼宝的朋友', type: 'entity' },
        { name: '鱼钩', type: 'entity' },
      ],
    ],
    description: '发怒冲刺期间依然会被鱼钩牵引，但不会掉落手中老鼠。',
  },
  {
    group: [
      { name: '发怒冲刺', type: 'skill' },
      { name: '星星', type: 'entity' },
      { name: '大星星', type: 'entity' },
      { name: '蓝图(投射物)', type: 'entity' },
      { name: '蓝图(召唤物)', type: 'entity' },
      { name: '线条猫', type: 'entity' },
    ],
    description:
      '发怒冲刺期间免疫8星变身效果和3级蓝图直接命中导致的变身效果，但不免疫1/2/4/6星的效果。若因为受到1/2/4/6星的效果而在蓝图内受到伤害，则会变为线条猫。',
  },
  {
    group: [
      { name: '手型枪', type: 'entity' },
      [
        { name: '铁血', type: 'knowledgeCard' },
        { name: '喜剧之王', type: 'skill' },
      ],
    ],
    description:
      '手型枪先造成伤害后造成眩晕。老鼠因手型枪伤害而进入铁血或1级喜剧之王的状态时，无法解除后续眩晕。',
  },
  {
    group: [
      { name: '手型枪', type: 'entity' },
      { name: '鼠虚弱', type: 'buff' },
    ],
    description:
      '手型枪可以抓回虚弱的老鼠，不会造成眩晕，但[3级的直接抓起效果会正常生效](效果持续期间，汤姆爪刀命中虚弱老鼠时会将其直接抓起)。',
  },
  {
    group: [
      { name: '手型枪', type: 'entity' },
      [
        { name: '变身饮料', type: 'item' },
        { name: '比利鼠', type: 'entity' },
      ],
    ],
    description:
      '手型枪可以抓回比利鼠，且比利鼠会受到眩晕。若手型枪已满3级且比利鼠在受手型枪眩晕期间解除变身状态，则仍可直接抓起。',
  },
  //----------------------------------布奇--------------------------------------------/
  {
    group: [
      { name: '垃圾盖', type: 'skill' },
      { name: '可破碎道具', type: 'itemGroup' },
    ],
    description:
      '2级垃圾盖可以直接震碎可破碎道具（{番茄}除外）。被垃圾盖震碎的道具会产生投掷命中墙壁/地面时的破碎效果。',
  },
  {
    group: [
      { name: '垃圾盖', type: 'skill' },
      { name: '纸盒', type: 'itemGroup' },
      { name: '面粉袋', type: 'item' },
    ],
    description: '2级垃圾盖无法震碎纸盒或面粉袋。',
  },
  //----------------------------------托普斯------------------------------------------/
  {
    group: [
      [
        { name: '双重猫格', type: 'skill' },
        { name: '托普斯分身', type: 'entity' },
      ],
      [{ name: '捕鼠夹', type: 'knowledgeCard' }],
    ],
    description: '托普斯分身继承的捕鼠夹等知识卡效果可以与托普斯自身叠加，效果因此翻倍。',
  },
  {
    group: [
      [
        { name: '双重猫格', type: 'skill' },
        { name: '托普斯分身', type: 'entity' },
      ],
      [
        { name: '知识渊博', type: 'knowledgeCard' },
        { name: '熊熊燃烧', type: 'knowledgeCard' },
      ],
    ],
    description: '托普斯分身无法继承知识渊博、熊熊燃烧等知识卡的效果。',
  },
  {
    group: [
      { name: '托普斯分身', type: 'entity' },
      { name: '猫虚弱', type: 'buff' },
    ],
    description: '3级托普斯分身无法转移老鼠夹与虚弱的控制效果。',
  },
  {
    group: [
      { name: '托普斯分身', type: 'entity' },
      { name: '格挡之剑', type: 'skill' },
    ],
    description: '格挡之剑的主动戳击无法命中托普斯分身。',
  },
  {
    group: [
      { name: '捕虫网', type: 'skill' },
      [
        { name: '天使翅膀', type: 'skill' },
        { name: '弹力圆球', type: 'skill' },
        { name: '怒气喷发', type: 'skill' },
        { name: '勇往直前', type: 'skill' },
        { name: '灵活跳跃', type: 'skill' },
        { name: '说出你的故事', type: 'skill' },
        { name: '滑步踢', type: 'skill' },
        { name: '梦幻舞步', type: 'skill' },
      ],
    ],
    description:
      '捕虫网无视大部分霸体效果，如3级天使翅膀，2级弹力圆球，2级怒气喷发，勇往直前，2级灵活跳跃，说出你的故事，滑步踢，梦幻舞步等。',
  },
  {
    group: [
      { name: '捕虫网', type: 'skill' },
      [
        { name: '降落伞', type: 'skill' },
        { name: '格挡之剑', type: 'skill' },
      ],
    ],
    description: '少部分霸体效果无视捕虫网，如降落伞，格挡之剑等。',
  },
  {
    group: [
      { name: '捕虫网', type: 'skill' },
      [
        { name: '头盔', type: 'skill' },
        { name: '头盔', type: 'entity' },
        { name: '军团战车', type: 'skill' },
        { name: '战车', type: 'entity' },
        { name: '仙女棒', type: 'skill' },
        { name: '小星星', type: 'entity' },
        { name: '乾坤袋', type: 'skill' },
        { name: '乾坤袋(NPC)', type: 'entity' },
        { name: '变身饮料', type: 'item' },
        { name: '比利鼠', type: 'entity' },
        { name: '机器鼠', type: 'entity' },
      ],
    ],
    description: '捕虫网无法网住绝大多数变身期间的老鼠。',
  },
  //----------------------------------莱特宁------------------------------------------/
  {
    group: [
      [
        { name: '咸鱼', type: 'skill' },
        { name: '穷追不舍', type: 'skill' },
      ],
      [
        { name: '应急治疗', type: 'specialSkill', factionId: 'mouse' },
        { name: '牛仔吉他', type: 'skill' },
      ],
    ],
    description:
      '应急治疗和2级牛仔吉他可以解除咸鱼附加的腥味debuff，也可以解除1级穷追不舍附加的debuff。',
  },
  //----------------------------------牛仔汤姆----------------------------------------/
  {
    group: [
      [
        { name: '斗牛', type: 'entity' },
        { name: '鞭子', type: 'skill' },
      ],
      { name: '可破碎道具', type: 'itemGroup' },
      { name: '纸盒', type: 'itemGroup' },
      { name: '面粉袋', type: 'item' },
      { name: '仙人掌', type: 'itemGroup' },
    ],
    description:
      '斗牛和鞭子均可以破坏可破碎道具（{冰块}和{番茄}除外），以及纸盒、面粉袋和牛仔杰瑞的仙人掌。被斗牛破坏的可破碎道具会产生投掷命中墙壁/地面时的破碎效果，而纸盒、面粉袋、仙人掌会直接消失。',
  },
  {
    group: [
      { name: '斗牛', type: 'entity' },
      { name: '格挡之剑', type: 'skill' },
    ],
    description: '剑客杰瑞格挡期间，可以使碰撞自身的斗牛立即消失。',
  },
  {
    group: [
      { name: '斗牛', type: 'entity' },
      [
        { name: '方块', type: 'entity' },
        { name: '强化方块', type: 'entity' },
      ],
    ],
    description: '方块可以阻挡斗牛，使其折返。',
  },
  {
    group: [
      { name: '说出你的故事', type: 'skill' },
      { name: '仙人掌弹弓', type: 'skill' },
    ],
    description:
      '牛仔汤姆位于米可采访范围内时，每射出1颗仙人掌球均会额外叠加1层素材（与其它叠加素材方式不冲突）。',
  },
  {
    group: [
      { name: '游刃有余', type: 'skill' },
      [
        { name: '兔子先生', type: 'entity' },
        { name: '侦探泰菲分身', type: 'entity' },
        { name: '饮料分身', type: 'entity' },
      ],
    ],
    description: '牛仔汤姆击倒部分NPC类衍生物也能触发2级游刃有余效果，如兔子先生，侦探泰菲分身等。',
  },
  {
    group: [
      { name: '游刃有余', type: 'skill' },
      [
        { name: '大星星', type: 'entity' },
        { name: '星星-敌方', type: 'entity' },
      ],
    ],
    description: '牛仔汤姆变身为大星星时，吐出的星星可以触发3级游刃有余的效果。',
  },
  //----------------------------------图多盖洛----------------------------------------/
  {
    group: [
      { name: '飞吻', type: 'entity' },
      { name: '牛仔吉他', type: 'skill' },
    ],
    description: '2级牛仔吉他可以解除飞吻造成的吻痕效果。',
  },
  {
    group: [
      { name: '香水区域', type: 'entity' },
      { name: '干扰器', type: 'entity' },
    ],
    description: '2级干扰器生效期间可以暂时无视香水区域的负面效果。',
  },
  {
    group: [
      { name: '香水区域', type: 'entity' },
      { name: '鞭炮', type: 'itemGroup' },
      [
        { name: '火药桶', type: 'entity' },
        { name: '火箭筒', type: 'entity' },
      ],
    ],
    description: '爆炸带有受力效果，因此鞭炮、火药桶、火箭筒的爆炸效果可以将香水区域炸飞。',
  },
  {
    group: [
      { name: '香水区域', type: 'entity' },
      [
        { name: '魔音穿耳', type: 'skill' },
        { name: '香风折扇', type: 'skill' },
        { name: '闪亮营救', type: 'skill' },
        { name: '勇往直前', type: 'skill' },
        { name: '滑步踢', type: 'skill' },
      ],
    ],
    description:
      '魔音穿耳、3级香风折扇、闪亮营救（满怒落地）、勇往直前、滑步踢的技能效果可以将香水区域弹飞。',
  },
  {
    group: [
      { name: '魅力甲油', type: 'skill' },
      [
        { name: '击晕', type: 'knowledgeCard' },
        { name: '猛攻', type: 'knowledgeCard' },
        { name: '乘胜追击', type: 'knowledgeCard' },
      ],
    ],
    description: '[部分](具体生效范围待补充)与爪刀有关的知识卡、特技能对甲油额外爪击区域生效。',
  },
  //----------------------------------侍卫汤姆----------------------------------------/
  //----------------------------------图茨--------------------------------------------/
  //----------------------------------米特--------------------------------------------/
  //----------------------------------塔拉--------------------------------------------/
  //----------------------------------剑客汤姆----------------------------------------/
  {
    group: [
      { name: '骑士连斩', type: 'skill' },
      { name: '泰菲类角色', type: 'itemGroup' },
    ],
    description:
      '泰菲类角色体型比正常角色小一些，所以剑客汤姆与他们处于同一平台时，骑士连斩第三段会因碰撞到平台/地面而连斩失败。剑客汤姆可通过[高低差](剑客汤姆在下方，泰菲在上方)或在泰菲因第二段挑飞而未落地前进行连斩，以避免这种情况。',
  },
  //----------------------------------库博--------------------------------------------/
  //----------------------------------凯特--------------------------------------------/
  //----------------------------------苏蕊--------------------------------------------/
  //----------------------------------天使汤姆----------------------------------------/
  //----------------------------------斯飞--------------------------------------------/
  //----------------------------------恶魔汤姆----------------------------------------/
  //----------------------------------兔八哥------------------------------------------/
  //----------------------------------追风汤姆----------------------------------------/
  //----------------------------------如玉--------------------------------------------/
  //----------------------------------杰瑞--------------------------------------------/
  //----------------------------------侦探杰瑞----------------------------------------/
  //----------------------------------罗宾汉杰瑞--------------------------------------/
  //----------------------------------航海士杰瑞--------------------------------------/
  //----------------------------------国王杰瑞----------------------------------------/
  //----------------------------------剑客杰瑞----------------------------------------/
  //----------------------------------泰菲--------------------------------------------/
  //----------------------------------剑客泰菲----------------------------------------/
  //----------------------------------牛仔杰瑞----------------------------------------/
  //----------------------------------恶魔杰瑞----------------------------------------/
  //----------------------------------恶魔泰菲----------------------------------------/
  //----------------------------------雪梨--------------------------------------------/
  //----------------------------------天使杰瑞----------------------------------------/
  //----------------------------------天使泰菲----------------------------------------/
  //----------------------------------魔术师------------------------------------------/
  //----------------------------------佩克斯------------------------------------------/
  //----------------------------------拿坡里鼠----------------------------------------/
  //----------------------------------侦探泰菲----------------------------------------/
  //----------------------------------剑客莉莉----------------------------------------/
  //----------------------------------罗宾汉泰菲--------------------------------------/
  //----------------------------------玛丽--------------------------------------------/
  //----------------------------------马索尔------------------------------------------/
  //----------------------------------米雪儿------------------------------------------/
  //----------------------------------音乐家杰瑞--------------------------------------/
  //----------------------------------蒙金奇------------------------------------------/
  //----------------------------------尼宝--------------------------------------------/
  //----------------------------------朵朵--------------------------------------------/
  //----------------------------------仙女鼠------------------------------------------/
  //----------------------------------米可--------------------------------------------/
  //----------------------------------霜月--------------------------------------------/
  //----------------------------------表演者•杰瑞-------------------------------------/
  //----------------------------------莱恩--------------------------------------------/
  //----------------------------------梦游杰瑞----------------------------------------/
  //----------------------------------鲍姆--------------------------------------------/
];

export default traits;
